In [1]:
%load_ext sql

In [2]:
%sql sqlite://

### 1. Таблица Account_levels.

Показать количество активных пользователей посуточно (без учета blocked и suspended пользователей).

In [3]:
%%sql
CREATE TABLE Account_levels(
        name TEXT,
        basic INTEGER,
        business INTEGER,
        wholesale INTEGER,
        date TEXT);

 * sqlite://
Done.

[]

In [4]:
%%sql
INSERT INTO Account_levels
VALUES ('total_count', 1000, 500, 100, DATETIME('2021-01-01')),
       ('total_count', 1010, 507, 101, DATETIME('2021-01-02')),
       ('suspended_count', 200, 100, 50, DATETIME('2021-01-01')),
       ('suspended_count', 201, 105, 48, DATETIME('2021-01-02')),
       ('blocked_count', 100, 50, 10, DATETIME('2021-01-01')),
       ('blocked_count', 101, 53, 12, DATETIME('2021-01-02'));

 * sqlite://
6 rows affected.

[]

In [5]:
%%sql
SELECT *
  FROM Account_levels

 * sqlite://
Done.

[('total_count', 1000, 500, 100, '2021-01-01 00:00:00'),
 ('total_count', 1010, 507, 101, '2021-01-02 00:00:00'),
 ('suspended_count', 200, 100, 50, '2021-01-01 00:00:00'),
 ('suspended_count', 201, 105, 48, '2021-01-02 00:00:00'),
 ('blocked_count', 100, 50, 10, '2021-01-01 00:00:00'),
 ('blocked_count', 101, 53, 12, '2021-01-02 00:00:00')]

In [6]:
%%sql
SELECT SUM(CASE name
           WHEN 'total_count' THEN basic
           ELSE -basic
            END
          ) AS basic,

       SUM(CASE name
           WHEN 'total_count' THEN business
           ELSE -business
            END
          ) AS business,
    
       SUM(CASE name
           WHEN 'total_count' THEN wholesale
           ELSE -wholesale
            END
          ) AS wholesale, date
  FROM Account_levels
 GROUP BY date;

 * sqlite://
Done.

[(700, 350, 40, '2021-01-01 00:00:00'), (708, 349, 41, '2021-01-02 00:00:00')]

### 2. Таблица Commitment_fees.
2.1 Показать таблицу: Day, Attempt_amount, Success_amount

In [7]:
%%sql
CREATE TABLE  Commitment_fees(
        user_id INTEGER,
        amount INTEGER,
        success INTEGER,
        date TEXT);

 * sqlite://
Done.

[]

In [8]:
%%sql
INSERT INTO Commitment_fees
VALUES (1000, 1000, 1, DATETIME('2021-01-01')),
       (1001, 1010, 0, DATETIME('2021-01-01')),
       (1002, 200, 1, DATETIME('2021-01-01')),
       (1003, 201, 0, DATETIME('2021-01-02')),
       (1004, 100, 0, DATETIME('2021-01-02')),
       (1005, 101, 1, DATETIME('2021-01-02'));

 * sqlite://
6 rows affected.

[]

In [9]:
%%sql
SELECT *
  FROM Commitment_fees;

 * sqlite://
Done.

[(1000, 1000, 1, '2021-01-01 00:00:00'),
 (1001, 1010, 0, '2021-01-01 00:00:00'),
 (1002, 200, 1, '2021-01-01 00:00:00'),
 (1003, 201, 0, '2021-01-02 00:00:00'),
 (1004, 100, 0, '2021-01-02 00:00:00'),
 (1005, 101, 1, '2021-01-02 00:00:00')]

In [10]:
%%sql
SELECT SUM(amount) AS Attempt_amount,
       SUM(success * amount) AS Success_amount,
       date
  FROM Commitment_fees
 GROUP BY date;

 * sqlite://
Done.

[(2210, 1200, '2021-01-01 00:00:00'), (402, 101, '2021-01-02 00:00:00')]

2.2 Показать таблицу: Day, Attempt_amount, Success_amount (на 30 дней раньше)

Не совсем понимаю, что тут можно показать, если у меня данных всего за 2 дня.

### 3. Таблица Account_levels.

Оценить эффект от перехода на поминтуный биллинг

In [11]:
%%sql
CREATE TABLE  Account_levels_2(
        user_id INTEGER,
        country TEXT,
        duration_sec INTEGER,
        tariff_per_minute INTEGER,
        date TEXT);

 * sqlite://
Done.

[]

In [12]:
%%sql
INSERT INTO Account_levels_2
VALUES (1000, 'UK', 103, 10, DATETIME('2021-01-01')),
       (1001, 'US', 5, 15, DATETIME('2021-01-02')),
       (1002, 'AU', 55, 17, DATETIME('2021-01-01')),
       (1003, 'KZ', 342, 22, DATETIME('2021-01-02'));

 * sqlite://
4 rows affected.

[]

In [13]:
%%sql
SELECT *
  FROM Account_levels_2;

 * sqlite://
Done.

[(1000, 'UK', 103, 10, '2021-01-01 00:00:00'),
 (1001, 'US', 5, 15, '2021-01-02 00:00:00'),
 (1002, 'AU', 55, 17, '2021-01-01 00:00:00'),
 (1003, 'KZ', 342, 22, '2021-01-02 00:00:00')]

Предполагаю, что ранее была посекундный биллинг - звонок 103 с оплачивается как 103/60 * тариф.

In [17]:
%%sql
SELECT (ROUND(duration_sec/60 + 0.5) * tariff_per_minute) AS per_minute,
       (ROUND((duration_sec * tariff_per_minute/60.0), 2)) AS per_second,
       ROUND((ROUND(duration_sec/60 + 0.5) * tariff_per_minute
       ) - (ROUND((duration_sec * tariff_per_minute/60.0), 2)), 2) AS profit 
  FROM Account_levels_2

 * sqlite://
Done.

[(20.0, 17.17, 2.83),
 (15.0, 1.25, 13.75),
 (17.0, 15.58, 1.42),
 (132.0, 125.4, 6.6)]

### 4. Можно ли применять GROUP BY к значениям NULL?

Можно групиировать по столбцам с NULL value. Чтобы в строчке не осталась без название можно использовать функцию COALESCE.